INHA-IN-GPS-2026/IN_GPS_ESP32/sdkconfig.defaults
# Permanent defaults. Logger uses an isolated generated sdkconfig.
# Root sdkconfig must also use the required logger values for ordinary IDF builds.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# BLE 컨트롤러 modem sleep (광고 인터벌 사이 라디오 정지)
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y

# ★★ BLE 저전력 클럭 — 2026-08-22 전환: MAIN_XTAL → EXT_32K_XTAL
#
#  rev 4.0 보드에 32.768kHz 크리스털(X1 + C11/C12 6pF)이 GPIO15/16
#  (XTAL_32K_P/N)에 실장되면서, 아래 트레이드오프가 사라졌다.
#
#   ┌─────────────┬────────────┬───────────┬──────────────────────────┐
#   │ lpclk       │ TX 피크    │ 평균전류  │ 비고                     │
#   ├─────────────┼────────────┼───────────┼──────────────────────────┤
#   │ MAIN_XTAL   │ ~150mA     │ ~21mA     │ 광고 사이 40MHz XTAL 유지│
#   │ RTC_SLOW    │ ~400mA     │ ~4mA      │ 매 광고마다 XTAL 냉시동  │
#   │ EXT_32K     │ 낮음       │ 최선      │ ★현재 선택               │
#   └─────────────┴────────────┴───────────┴──────────────────────────┘
#
#  왜 이 전환이 전원 설계의 전제인가 (Docs/INGPS_슈퍼캡_축전시간_분석_2026-08-11.md §6-3):
#    POWER_V4의 R5(100Ω)가 배터리에서 보낼 수 있는 최대 전력은 V²/4R = 32.4mW다.
#    MAIN_XTAL 구성의 실측 21mA는 75.6mW를 요구하므로 **동작점이 아예 없다** —
#    슈퍼캡이 마르면 슈퍼바이저가 EN을 내리고, 재축전 후 다시 부팅을 시도하는
#    34초 주기 히컵 루프가 된다. 3.3V 레일이 정상적으로 꺼지므로 BOD 로그도
#    남지 않고, wdt_guard의 crash-loop escalation도 POWERON으로 분류되어
#    작동하지 않는다. 즉 이 두 줄이 "전원이 켜지느냐"를 가른다.
#
#  ⚠ 크리스털 미검출 시 IDF가 조용히 내부 RC로 폴백한다. 플래시 후 반드시
#    확인할 것 — R5 양단 전압으로 평균전류 역산(457µA면 46mV)이 가장 확실하다.
#    또는 app_main.c의 INGPS_PM_DEBUG=1로 esp_pm_dump_locks 확인.
CONFIG_RTC_CLK_SRC_EXT_CRYS=y
CONFIG_BT_CTRL_LPCLK_SEL_EXT_32K_XTAL=y

# ★ BOD 임계 = IDF 기본 LVL7(≈2.44V)로 원복(2026-07-31).
#  S3는 SEL 숫자↑ = 임계전압↓ (정확한 라벨은 menuconfig에서 확인).
#  2026-07-18의 7→5는 "완화" 의도였으나 실제로는 임계를 ≈2.67V로 올려
#  TX 스파이크 dip(데브킷 실측 3.0V 미만)에 더 민감해진 변경이었다 → 원복.
#  ⚠ 2.44V는 플래시 write 안전선(~2.7V) 아래. 런타임 NVS commit은 반드시
#    nvs_safe_commit()(main/nvs_safe.h — adv 정지→commit→재개) 경유할 것.
#  ※ POWER_V4에서는 3.3V 레일이 부스트 출력이라, 레일이 무너지기 전에
#    SW_REG측 슈퍼바이저(TPS3839G25, V_off≈2.52V)가 먼저 EN을 내린다.
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

# ★ 플래시 — 모듈이 ESP32-S3-WROOM-1-N16R8(16MB)인데 종전 설정은 2MB였다.
#  2MB로 두면 부트로더 헤더가 14MB를 죽은 영역으로 남긴다.
#  ※ 파티션 테이블은 일부러 건드리지 않았다(SINGLE_APP 유지). 플래시 크기와
#    파티션 레이아웃은 독립이라, 크기만 고치면 erase-flash 없이 그대로 올라간다
#    — NVS(as6221 주소 knob 등)가 보존된다. app 파티션 1MB가 모자라면 그때
#    CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y로 올리고 erase-flash 할 것.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ※ PSRAM(8MB, N16R8의 R8)은 의도적으로 켜지 않는다. 이 펌웨어는 힙이 남고,
#   SPIRAM을 켜면 상시 리프레시 전류가 붙어 1년 전력 예산과 정면 충돌한다.

# ★ light sleep 진단용(2026-08-03). 평상시엔 꺼둔다 — 슬립 경로에 훅이 추가된다.
#  "Light sleep: ENABLED" 로그는 esp_pm_configure()가 설정을 수락했다는 뜻일 뿐
#  실제 진입을 보장하지 않는다. 진입 횟수·누적 수면시간을 세려면 이 옵션을 켜고
#  app_main.c의 INGPS_PM_DEBUG를 1로 둘 것(15초마다 실적+락 목록 출력).
#  2026-08-03 실측: 이 방법으로 light sleep 점유율 92~94% 확인 완료.
# CONFIG_PM_LIGHT_SLEEP_CALLBACKS=y

# Direct GATT batch logger.
CONFIG_INGPS_BATCH_LOGGER=y
# Thirty-minute acquisition; use 300 for a short validation run.
CONFIG_INGPS_LOGGER_DURATION_S=1800
CONFIG_INGPS_LOGGER_DIAGNOSTICS=y
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_RISCV=y
CONFIG_ULP_COPROC_RESERVE_MEM=7168
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_GATT_CLIENT=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=23
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_logger.csv"
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=8
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
